[{"title": "Market Today Summit: ‘We’re probably seeing the last leg of the funding winter’, say experts ", "date": "Jan 24, 2023", "sub para": "<p>Also read: <a href=\"https://www.businesstoday.in/markets/story/bt-markets-today-summit-which-way-will-wind-blow-for-indian-economy-heres-what-experts-say-367344-2023-01-24\">BT Markets Today summit: Which way will wind blow for Indian economy? Here's what experts say</a></p>", "link": "https://www.businesstoday.in/latest/economy/story/market-today-summit-were-probably-seeing-the-last-leg-of-the-funding-winter-say-experts-367348-2023-01-24", "para": "Enough has been said about the global capital market slowdown of 2022. While India remains one of the better positioned economies — vis-a-vis the West, China, and parts of Europe —it hasn’t been entirely unaffected either. Global VC and PE funding into the country dropped by 35 per cent last year; several new-age companies withdrew their IPOs, and so on.  \nNone \nNone \nNone \nNone \nNone \nNone \nNone \nNone \nNone \nNone \nNone \n"}, {"title": "‘India’s fortunes critical to the world; its rise welcomed by the world’: Kumar Mangalam Birla", "date": "Jan 24, 2023", "sub para": "<p><em><strong>Also read: <a href=\"https://www.businesstoday.in/lifestyle/fashion/story/aditya-birla-groups-fashion-arm-teams-up-with-frances-galeries-lafayette-to-open-luxury-stores-in-india-353198-2022-11-17\" target=\"_blank\">Aditya Birla Group's fashion arm teams up with France's Galeries Lafayette, to open luxury stores in India</a></strong></em></p>", "link": "https://www.businesstoday.in/latest/economy/story/indias-fortunes-critical-to-the-world-its-rise-welcomed-by-the-world-kumar-mangalam-birla-367330-2023-01-24", "para": "Chairman of the Aditya Birla Group, Kumar Mangalam Birla, in a note on the year gone by and the year ahead, said that some of his beliefs such as “sanity over vanity in valuations”, role of large corporations as engines for growth and societal good, and WFO over WFH have stayed true. But some beliefs like his conviction about the “roaring 2020s” needs more conviction, he said.  \nHe said that three years ago the pandemic felt apocalyptic but the collective bounce-back was equally remarkable. He further said that the new geopolitical normal has changed everything from supply chains to fortunes of nations.  \nKM Birla listed five broad trends that he thinks would have a multi-year impact: \nNone \nBirla said that there is a decadal reshaping of supply chains underway and India is emerging as the clear choice. “As India further opens up to trade and investment, forms new alliances and reaffirms old ones in the changing world order, it will have a unique place in the global economy. It is now up to us, its people, its companies, and its leaders to harness these opportunities in India’s favour,” he said.  \nNone \nHe also lauded businesses whole-heartedly committing towards cleaner energy. “The pendulum of climate change will swing globally when we can find technology led solutions to marry the material aspirations of current generations with responsibility towards the lives of future generations. And nowhere is that truer than in rapidly emerging countries like India,” he said.  \nNone \n“Big bets need to be orchestrated based on your own fundamental strengths - better unit economics, massive scale, network advantages,  speed etc. If you do not continuously reshape the terms of the industry  based on these big bets, someone else definitely will be playing to theirs,” he said, further adding that metrics matter even in the absence of perfect analogues.  \nNone \nCiting Tom Cruise’s 1986 blockbuster movie, Top Gun and its $1-billion grossing blockbuster sequel Top Gun Maverick (2022), Birla said that the franchise was carried not only by the shoulders of nostalgic Gen Xers of Cruise’s youth but also by the “enthusiastic embrace” of Gen Z. \n“Across the corporate landscape, companies will be asked pressing questions regarding their own futures. What is the unique formula that harnesses historic moats formed by brand power, distribution might, or technology prowess, with a forward-looking product pipeline, consumer relevance and an agile, young workforce? And what are the bets that see through the short-term fads and translate into sustainable advantage? I do not have the answers to all these questions but take heart in some of the unique experiments that we have underway to find solutions,” he said.  \nNone \n“As we grow, we expand our capacity to receive. We enhance our absorption of talent, technology, and capital. This, in turn, enables us to increase our ability to give back, create impact, and enrich lives. This virtuous cycle is at the heart of being a successful purpose-driven organisation,” said Birla.  \nHe said that stories from the past are portends for the future and point to the limitless possibilities ahead of us.  \nNone \nNone \n"}, {"title": "India’s first stack developers conference on Jan 25: Domestic, foreign start-ups to participate", "date": "Jan 24, 2023", "sub para": "<p><em><strong>Also read: <a href=\"https://www.businesstoday.in/latest/policy/story/deep-imbalance-in-content-creation-and-monetisation-mos-it-rajeev-chandrasekhar-366976-2023-01-21\" target=\"_blank\">Deep imbalance in content creation and monetisation: MoS IT Rajeev Chandrasekhar</a></strong></em></p>", "link": "https://www.businesstoday.in/latest/economy/story/indias-first-stack-developers-conference-on-jan-25-domestic-foreign-start-ups-to-participate-367290-2023-01-24", "para": "India’s first stack developers conference will be held on January 25 at the India Habitat Centre in Delhi, organised by the National e-Governance Division (NeGD) and Ministry of Electronics and Information Technology (MeitY). Union Minister of State for Entrepreneurship, Skill Development, Electronics & Technology Rajeev Chandrasekhar said that the annual India Stack Developer Conference 2023 will be aimed at expanded adoption of stack in states and countries around the world that want to build digital public platforms. \nThe minister also thanked Prime Minister Narendra Modi for envisioning India stack. The conference will kickstart at 10:30 am and will be attended by the minister.  \nNone \nChandrasekhar while speaking with Business Today at World Economic Forum 2023 at Davos had also said that at least seven countries have showed serious interest in adopting and customising India stack. “Many countries and without revealing the names, I can tell you that at least seven countries have evinced serious interest in adopting India stack, in customising it,\" he had said.  \nHe added that there is a lot of \"awe and respect\" for how India used technology during COVID and how many of the government's decisions till up to 2020 came in handy in the battle against the pandemic.  \nMeanwhile, the upcoming conference aims to engage with the developer community and explore ways and means to further develop solutions for societal problems. They would base these solutions on the artifacts of India stack and would also take India stack to other countries that want to replicate some of these solutions.  \nThe India Stack Developer Conference would discuss how the developer community can leverage India stack to fast-track innovation, how the community can contribute to India stack, how the government can do ease of doing business by using India stack, how to arrive at a common mechanism of engagement, and how to take India stack global.  \nThe basic building blocks of India stack are based on open standards and are interoperable. By leveraging the APIs of products like Digilocker and Healthstack, many services have been made available.  \nIndia implemented several digital transformational projects in the last eight years, including Aadhaar, Unified Payment Interface (UPI), Digilocker, CoWin Vaccination Platform, Government e-Market Place, DIKSHA, Ayushman Bharat Digital Health Mission and more.  \nNone \nNone \n"}, {"title": "Colocation case: SAT relief for NSE, to pay Rs 100 cr to Sebi", "date": "Jan 23, 2023", "sub para": "<p>Ramkrishna was arrested last March in the colocation case by the Central Bureau of Investigation.</p>", "link": "https://www.businesstoday.in/latest/economy/story/colocation-case-sat-relief-for-nse-to-pay-rs-100-cr-to-sebi-367179-2023-01-23", "para": "India's appeals tribunal on Monday set aside a ruling by the Securities and Exchange Board of India (SEBI) against the National Stock Exchange in a colocation case, lawyers representing the two parties said on Monday. \nThe Securities Appellate Tribunal (SAT) ordered the country's largest exchange to pay a penalty of 100 crore rupees ($12.3 million) for the lapses in its systems, the lawyer representing NSE said in Mumbai. \nThe lawyers declined to be named as they were not allowed to speak to media. \nOfficials at NSE and SEBI did not immediately respond to Reuters request for comment. \nIn 2019, SEBI passed a series of orders against the NSE and its former chief executives, Chitra Ramkrishna and Ravi Narain, alleging that the exchange did not exercise due diligence when putting in place a network that allowed high-frequency traders unfair access to some network servers at the exchange. \nSEBI had ordered the NSE to deposit nearly 1,100 crore rupees, including interest, in an investor fund and barred it from raising money on the securities market directly or indirectly for six months. \nIt had also asked Narain and Ramkrishna to return 25% of the salaries they had received during the relevant period. \nThe Securities Appellate Tribunal on Monday ruled that SEBI's disgorgement was unjust and that the exchange and its former officials did not enrich themselves. \n\"The disgorgement on NSE, Ramkrishna and Narain has been set aside since SEBI failed to establish illegal gains,\" a lawyer representing SEBI said in the tribunal. \nSEBI had, in its order, said it found NSE systems at fault and gave preferential access to select brokers when they accessed its high-speed algorithmic trading platform and colocation facility. \nTh ban on Ramkrishna and Narain from capital market has been reduced to a ban already undergone, the lawyer said. \nRamkrishna was arrested last March in the colocation case by the Central Bureau of Investigation. \n"}, {"title": "Parakram Diwas 2023: PM Modi names 21 largest unnamed islands of Andaman & Nicobar islands; check details", "date": "Jan 23, 2023", "sub para": "<p>Also Read: <a href=\"https://www.businesstoday.in/magazine/back-of-the-book/story/many-faces-of-ex-rbi-governor-bimal-jalan-movie-buff-foodie-the-polite-killer-of-mega-bank-strikes-367109-2023-01-23\" title=\"Many faces of ex-RBI Governor Bimal Jalan: Movie-buff, foodie, the polite killer of mega bank strikes\">Many faces of ex-RBI Governor Bimal Jalan: Movie-buff, foodie, the polite killer of mega bank strikes</a></p>", "link": "https://www.businesstoday.in/latest/economy/story/parakram-diwas-2023-pm-modi-names-21-largest-unnamed-islands-of-andaman-nicobar-islands-check-details-367127-2023-01-23", "para": "Twenty-one large unnamed islands of Andaman & Nicobar Islands were named after Param Vir Chakra awardees in a ceremony attended by Prime Minister Narendra Modi on the occasion of Parakram Diwas on Monday. The Prime Minister also unveiled the model of the National Memorial dedicated to Netaji Subhash Chandra Bose to be built on Netaji Subhas Chandra Bose Dweep, earlier known as Ross Islands. \nThe largest unnamed island was named after the first Param Vir Chakra awardee, Major Somnath Sharma, who was martyred in action on November 3, 1947 while repulsing Pakistani infiltrators near Srinagar Airport. \nPM Modi said, \"This land of Andaman is the land where the tricolour was hoisted for the first time. Where the government of independent India was formed for the first time. Today is the birth anniversary of Netaji Subhash Bose. The country celebrates this day as Parakram Diwas,\" ANI reported. \nHe added, \"'India First' was the only resolution for all 21 Paramveers; today in the naming of these islands, their resolution has become immortal forever. The potential of Andamans is huge. In the past 8 years, the country has made continuous efforts in this direction.\" \nNone \nThe 21 Param Vir Chakra awardees, after whom the islands have been named are: Major Somnath Sharma; Subedar and Hony Captain (then Lance Naik) Karam Singh, MM; 2nd Lt. Rama Raghoba Rane; Nayak Jadunath Singh; Company Havildar Major Piru Singh; Capt GS Salaria; Lieutenant Colonel (then Major) Dhan Singh Thapa; Subedar Joginder Singh; Major Shaitan Singh; CQMH. Abdul Hamid; Lt Col Ardeshir Burzorji Tarapore; Lance Naik Albert Ekka; Major Hoshiar Singh; 2nd Lt. Arun Khetrapal; Flying Officer Nirmaljit Singh Sekhon; Major Ramaswamy Parameswaran; Naib Subedar Bana Singh; Captain Vikram Batra; Lt Manoj Kumar Pandey; Subedar Major (then RifleMan) Sanjay Kumar; and Subedar Major Retd (Hony Captain) Grenadier Yogendra Singh Yadav. \nParakram Diwas is observed on January 23 to commemorate the birth anniversary of freedom fighter Subhas Chandra Bose. This year marks the 126th anniversary of Bose, fondly called as 'Netaji'. \nOn the birth anniversary of Netaji Subhash Chandra Bose, Prime Minister Narendra Modi also paid homage to him and remembered his unparalleled contribution to India's history. \nToday, on Parakram Diwas, I pay homage to Netaji Subhas Chandra Bose and recall his unparalleled contribution to India’s history. He will be remembered for his fierce resistance to colonial rule. Deeply influenced by his thoughts, we are working to realise his vision for India. \nNone \n"}, {"title": "Canada's energy jobs transition bill sparks discord in oil heartland", "date": "Jan 23, 2023", "sub para": "<p>\"It's 100% not that simple...to go from making C$100,000 to C$40,000 plays a big part in the decision-making that comes with the idea of losing your livelihood,\" Austin said.</p>", "link": "https://www.businesstoday.in/latest/economy/story/canadas-energy-jobs-transition-bill-sparks-discord-in-oil-heartland-367090-2023-01-23", "para": "In Canada's western oil patch, controversy is raging over federal government legislation intended to help the fossil fuel labour force transition to a greener economy, but union and community leaders are warning politicization of the Just Transition bill obscures the needs of workers. \nPrime Minister Justin Trudeau's Liberal government is expected to table its long-awaited workforce transition bill this spring, ahead of economic changes expected as they pursue ambitious goals to slash climate-warming emissions. \nThe government of Alberta, Canada's main crude-producing province, says the legislation will dismantle the oil and gas industry that makes up 5% of Canada's GDP. \n\"When I hear the words \"Just Transition\" it signals eliminating jobs and for Alberta, that is a non-starter!\" Alberta's Conservative Premier Danielle Smith wrote on Twitter last week. \nThe oil and gas sector employs around 185,000 workers, making the bill a hot topic in Alberta ahead a provincial election in May. Smith is using the threat of job losses to attack Trudeau and rally her conservative base, although she has been criticised for misinterpreting how many jobs may be at risk. \nThe Trudeau government is trying to soothe concerns about the bill, first promised in 2019. A government source familiar with the file, who is not authorized to speak publicly, said the legislation will be about principles to guide decisions and creating jobs. \nTrudeau told Reuters in a recent interview that the sooner Alberta's \"political class\" understood the future is not to be feared, the better.  \n\"This shouldn't be a political issue, this is an issue about what's really happening in the global economy,\" said Gil McGowan, President of the Alberta Federation of Labour (AFL). \nCOAL PHASE-OUT LESSONS \nThe focus should be on helping communities adjust to sweeping industrial changes and economic diversification, McGowan said, pointing to Alberta's recent coal phase-out as a case study. \nLater this year, Alberta's last coal-fired power station will convert to natural gas, part of an accelerated energy transition first announced in 2015 that will wrap up seven years ahead of schedule. \nMore than 3,100 people worked in the province's thermal coal industry in 2015. Some workers took early retirement, others went north to the oil patch or moved to other industries, while others found work in mine reclamation or the newly converted gas power stations. \nThe Parkland Institute research centre estimated in 2019 that up to 3,500 new jobs would be created in renewable energy and coal-to-gas power station conversions, but lead author Ian Hussey now says that number was far too low. \n\"Renewable investment has taken off in Alberta in a way that was never even dreamed of when we did that research,\" he said. \nThe oil and gas sector is currently experiencing a skills shortage amid tight labour markets globally, but the current workforce is 18% smaller than the 2014 peak of 225,900, according to Energy Safety Canada. Think tank Clean Energy Canada estimates there could be 200,000 clean energy jobs created by 2030. \nIf done right, the bill could incentivise technologies like carbon capture and hydrogen and be Canada's answer to the U.S. Inflation Reduction Act, the $430-billion green energy subsidy package passed last year, the AFL's McGowan added. \nEx-coal miner Len Austin, who now runs a government-funded Just Transition centre supporting former coal workers, said policymakers made a \"really good effort\" with programs such as retirement bridging, relocation packages and C$12,000 ($8,945.21) retraining vouchers. \nBut there was insufficient funding for economic diversification and infrastructure projects within coal communities to create new jobs, and governments need to understand not everyone can work in renewables, he added. \n\"It's 100% not that simple...to go from making C$100,000 to C$40,000 plays a big part in the decision-making that comes with the idea of losing your livelihood,\" Austin said. \n"}, {"title": "US to cut visa wait times for Indians; to open additional slots on select Saturdays ", "date": "Jan 23, 2023", "sub para": "<p>Also read: <a href=\"https://www.businesstoday.in/technology/news/story/elon-musk-refutes-reports-of-1300-employee-count-at-twitter-367073-2023-01-23\" title=\"Elon Musk refutes reports of 1300 employee count at Twitter\">Elon Musk refutes reports of 1300 employee count at Twitter</a></p>", "link": "https://www.businesstoday.in/latest/economy/story/us-to-cut-visa-wait-times-for-indians-to-open-additional-slots-on-select-saturdays-367075-2023-01-23", "para": "The US embassy in India is aiming to cut visa wait times for applicants with initiatives like special interviews for first-time applicants and greater strength of visa staff across the country.  \nAs part of these attempts, the US embassy in Delhi and its consulates in Mumbai, Chennai, Kolkata, and Hyderabad conducted special interviews on Saturday, January 21, to accommodate applicants requiring in-person visa interviews. According to the US embassy statement, the embassy will continue to open additional slots on select Saturdays in the coming months.  \nThe US embassy said in a statement accessed by news agency ANI, “On January 21, the US Mission in India launched the first in a series of special Saturday interview days, as part of a larger effort to reduce wait times for first-time visa applicants. The United States embassy in New Delhi and Consulates in Mumbai, Chennai, Kolkata, and Hyderabad opened consular operations on Saturday to accommodate applicants [requiring] in-person visa interviews.” \nThe statement added that in another attempt to save time, the US government has implemented remote processing of interview waiver cases for applicants having previous US visas. It further noted many temporary consular officers from Washington and other embassies will come to India to raise processing capacity.  \nThe US State Department is also increasing the number of consular officers permanently assigned to the Embassy and Consulates. The US mission in India has released over 2.5 lakh additional B1 (business) and B2 (tourism) appointments. The US Consulate General Mumbai has also increased its weekday operating hours to accommodate additional appointments.  \nThe US embassy also stated that the mission in India will be fully staffed and it is likely to process visas at pre-COVID levels. The COVID-19 pandemic impacted US visa processing massively and many of the embassies and consulates were only able to offer emergency services.  \n(With agency inputs) \nNone \nNone \n"}, {"title": "PM Modi to name 21 unnamed islands of Andaman & Nicobar after Param Vir Chakra awardees", "date": "Jan 23, 2023", "sub para": "<p><em><strong>Also read: <a href=\"https://www.businesstoday.in/latest/story/all-not-well-in-ladakh-sonam-wangchuk-appeals-to-pm-modi-plans-to-sit-on-climate-fast-367048-2023-01-22\" target=\"_blank\">'All not well in Ladakh': Sonam Wangchuk appeals to PM Modi, plans to sit on 'Climate Fast'</a></strong></em></p>", "link": "https://www.businesstoday.in/latest/economy/story/pm-modi-to-name-21-unnamed-islands-of-andaman-nicobar-after-param-vir-chakra-awardees-367070-2023-01-23", "para": "Prime Minister Narendra Modi will name 21 unnamed islands of Andaman & Nicobar Islands after 21 Param Vir Chakra awardees today. The Prime Minister will also unveil the National Memorial dedicated to Netaji Subhash Chandra Bose on Netaji Subhas Chandra Bose Dweep. PM Modi will participate in the event via video conferencing at 11 am.  \nThe largest unnamed island will be named after the Param Vir Chakra awardee, the second after the second Param Vir Chakra awardee and so on. The renaming comes as the government aims to give an everlasting tribute to national heroes.  \nNone \nThe awardees after whom the islands will be named are: Major Somnath Sharma; Subedar and Hony Captain (then Lance Naik)  Karam Singh, MM; 2nd Lt. Rama Raghoba Rane; Nayak Jadunath Singh; Company Havildar Major Piru Singh; Capt GS Salaria; Lieutenant Colonel (then Major) Dhan Singh Thapa; Subedar Joginder Singh; Major Shaitan Singh; CQMH. Abdul Hamid; Lt Col Ardeshir Burzorji Tarapore; Lance Naik Albert Ekka; Major Hoshiar Singh; 2nd Lt. Arun Khetrapal; Flying Officer Nirmaljit Singh Sekhon; Major Ramaswamy Parameswaran; Naib Subedar Bana Singh; Captain Vikram Batra; Lt Manoj Kumar Pandey; Subedar Major (then RifleMan) Sanjay Kumar; and Subedar Major Retd (Hony Captain) Grenadier Yogendra Singh Yadav. \nRoss Islands was renamed as Netaji Subhash Chandra Bose Dweep when PM Modi visited the island in 2018, while Neil Island and Havelock Island were renamed Shaheed Dweep and Swaraj Dweep.  \nNone \n"}, {"title": "BPCL to shut Bina refinery in June for maintenance", "date": "Jan 23, 2023", "sub para": "<p>Sources said the planned shutdown of units at BPCL's refineries will not lead to shortages and the company will meet its supply commitments.</p>", "link": "https://www.businesstoday.in/latest/economy/story/bpcl-to-shut-bina-refinery-in-june-for-maintenance-367062-2023-01-23", "para": "India's Bharat Petroleum Corp plans to shut its 156,000 barrels-per-day (bpd) Bina refinery in central India for about a month in June for maintenance, two sources familiar with the plan said. \nThe state-run refiner also plans to shut half of its 240,000 bpd Mumbai refinery in western India for three to four weeks in September-October for maintenance, the sources said. \nBPCL's spokesperson did not respond to a Reuters' request for comments. \nSources said the details of the shutdown plan are \"tentative\" and dates will be finalised later. \n\"As of now plan is to shut Bina refinery from June 1, once Numaligarh (refinery) is back from its shutdown,\" one of the sources said. \nIndian refiners have to shut units at refineries once every four years for maintenance and inspection. \nNumaligarh Refinery Ltd plans to shut its 60,000-bpd plant in the northeast for about 40 days up to the end of April for maintenance, a company spokesperson told Reuters. \nSources said the planned shutdown of units at BPCL's refineries will not lead to shortages and the company will meet its supply commitments. \n"}, {"title": "After India, China gives financing assurances to Sri Lanka for IMF bailout package", "date": "Jan 22, 2023", "sub para": "<p>The IMF facility would enable the island nation to obtain bridging finance from markets and other lending institutions such as the ADB and the World Bank.<br/>\n </p>", "link": "https://www.businesstoday.in/latest/economy/story/after-india-china-gives-financing-assurances-to-sri-lanka-for-imf-bailout-package-367039-2023-01-22", "para": "China has given debt-ridden Sri Lanka the financing assurances required by the IMF to unlock a USD 2.9 billion bailout package for the country, days after India strongly backed the island nation's efforts to secure the loan from the global lender to recover from its worst-ever economic crisis. \nThe Sunday Times newspaper reported that China's Exim Bank delivered a letter on Saturday granting Sri Lanka a two-year moratorium on repayment and agreeing with the International Monetary Fund's extended fund facility (EFF). \nThe report was confirmed by Sri Lankan officials who did not want to be named. \nThe Chinese response came close on the heels of India stepping in first to issue the necessary assurances last week. \nIndia's ministry of finance last week issued a letter to the IMF to confirm its support to Sri Lanka on the issue of debt restructuring, ahead of the visit by the external affairs minister S Jaishankar to Colombo which concluded on Friday. \nJaishankar during his visit also announced that India has given the required assurances to Sri Lanka for the bailout package. \nSri Lankan officials said that China had agreed to a short-term suspension of what Sri Lanka owed and expects Sri Lankan creditors to get together to work out the medium and long-term commitments. \nThe IMF in September last year approved Sri Lanka a 2.9 billion dollar bailout package over 4 years pending Sri Lanka's ability to restructure its debt with creditors -- both bilateral and sovereign bond holders. \nBy the end of June 2022, Sri Lanka owed nearly USD 40 billion to bilateral, multilateral and commercial loans, according to the figures released by the Treasury. \nChinese loans amounted to 20 per cent of the total debt owed and 43 per cent of the bilateral loans. \nSri Lanka in April declared its first-ever debt default in its history as the economic crisis triggered by forex shortages sparked public protests. \nMonths-long street protests led to the ouster of the then president Gotabaya Rajapaksa in mid-July. Rajapaksa had started the IMF negotiations after rejecting to tap the global lender for support. \nWith assurances from creditors, the 2.9 billion dollar facility could get the IMF board approval in March, officials said. \nSri Lanka has introduced painful economic measures such as tax hikes and utility rate hikes. Trade unions and opposition groups have organised protests against such measures. \nThe IMF bailout has been put on a halt as Sri Lanka pursues talks with creditors to meet the global lender's condition for the facility to help it get through its worst economic crisis since independence in 1948. \nEarlier, Sri Lanka completed its debt restructuring talks with Japan. \nNone \n"}, {"title": "ICICI-Videocon loan fraud case: Bombay High Court grants interim bail to Venugopal Dhoot", "date": "Jan 20, 2023", "sub para": "<p><em><strong>Also read: <a href=\"https://www.businesstoday.in/latest/economy/story/bombay-high-court-grants-bail-to-chanda-deepak-kochhar-359398-2023-01-09\" target=\"_blank\">ICICI Bank-Videocon loan fraud: Bombay High Court grants bail to Chanda, Deepak Kochhar</a></strong></em></p>", "link": "https://www.businesstoday.in/latest/economy/story/icici-videocon-loan-fraud-case-bombay-high-court-grants-interim-bail-to-venugopal-dhoot-366841-2023-01-20", "para": "The Bombay High Court has granted interim bail to Videocon Group Chairman Venugopal Dhoot in the ICICI-Videocon loan fraud case. He will be out of judicial custody provided he furnishes Rs 1 lakh bail cash.  \nThe order was passed by a division bench comprising Justices Revati Mohite Dere and PK Chavan.  \nDhoot, a co-accused, along with former ICICI Bank MD Chanda Kochhar and businessman-husband Deepak Kochhar, was arrested on December 26 by the Central Bureau of Investigation. The CBI stated that Dhoot was non-cooperative.  A special court remanded Dhoot to judicial custody on December 29.  \nThe Videocon Group Chairman approached the special court challenging his arrest, which was rejected by the court. Following this, Dhoot approached the Bombay High Court to challenge his alleged ‘illegal arrest’.  \nHis lawyer argued that Dhoot’s arrest was arbitrary, illegal and in gross violation of Sections 41 and 41A of the Code of Criminal Procedure (CrPC), according to a report in Bar and Bench. The lawyer also argued that Dhoot appeared before the CBI on his own on December 26 after he missed the summons on December 24 and 24. He said that despite that Dhoot’s non-appearance was considered non-cooperation and he was arrested.  \nThe CBI counsel said that the Kochhars and Dhoot systematically tried to evade interrogation, and hence was arrested for his non-cooperation. \nThe Kochhars were also given bail in the same case on January 9. The Bombay High Court held that their arrests were not in accordance with the law. A division bench of Justices Revati Mohite Dere and PK Chavan said that the arrests were made in violation of Section 14A of the Code of Criminal Procedure (CrPC) that states that a notice must be sent before the appearance of the concerned police officer. \nThe Kochhars and Dhoot were arrested in connection with allegations of loan fraud. Chanda Kochhar is alleged to have sanctioned loans to Videocon Group in exchange for kickbacks in the way of investments by Dhoot in Deepak Kochhar’s Nupower Renewables. It is alleged that the bank sanctioned credit facilities to the tune of Rs 3,250 crore to Videocon Group. \nNone \n"}, {"title": "Govt in advanced talks with industry for setting up international aviation hub in India, says Jyotiraditya Scindia", "date": "Jan 19, 2023", "sub para": "<p>If the minister’s plan comes to fruition, the country would not only offer an alternative to rival international aviation hubs such as Dubai and Singapore in Asia-Pacific but also make international fares from India more competitive.</p>", "link": "https://www.businesstoday.in/latest/economy/story/govt-in-advanced-talks-with-industry-for-setting-up-international-aviation-hub-in-india-says-jyotiraditya-scindia-361149-2023-01-19", "para": "The government is seriously pursuing its target of establishing an international aviation hub in India and was already in advanced talks with a couple of Indian carriers and an airport in this regard, civil aviation minister Jyotiraditya Scindia has said. \n“We are in talks with two to three airlines and an airport for the creation of an international hub in India. And for the creation of that hub, you got to take the volatility out of the arrival and departure plans and smoothen out that curve so that you can provide the incoming flights time to allow international departures,” the minister said in response to a query from an industry representative at a civil aviation conference organised by the industry body ASSOCHAM on Wednesday. \nHe said since the exercise could only be accomplished in conjunction with both the airlines and airports, the ministry of civil aviation was doing its bit in turning the ambition into a reality of creating a hub for international and domestic passengers in India by utilising Indian airports and Indian aircraft. \nReferring to the significant growth being witnessed in the world’s third-largest domestic aviation market, the minister said India should be able to touch 400 million airline passengers in the next eight years, while it was just one airport short of doubling its airport capacity to 148 airports from just 74 in FY13-14. He added that given the fleet acquisition plans of Indian carriers, the total number of civilian aircraft in the country would reach anywhere from 1,500-2,000 over the next seven years from the present 700. \n“That means you have reached capacity. You have reached a potential wherein you need to start sowing the seeds today of creating a hub within India,” the minister urged. \nIt was with this objective that MoCA was actively persuading Indian carriers to launch point-to-point flights on international routes. \n“Today, on domestic routes we are pretty much well settled. But on international routes, it is mostly Sixth Freedom [Right]. You have hubs located outside India. They use India as a transit point and then a long-haul flight takes you to your ultimate destination. It is important for our airlines to also start going from point to point,” the minister said. \nThe Sixth Freedom of the Air allows a carrier the right to transport international traffic moving between two other states via its home state. For instance, Emirates is allowed to ferry passengers from India between India and the UAE to the US via its base in Dubai. \nThe minister praised Air India, Vistara, SpiceJet and other Indian carriers for ordering more wide-bodied aircraft as that would enable them to undertake flights above eight hours. He said that to help Indian carriers meet their short-term requirements, MoCA had allowed them to wet lease aircraft for an extended period of up to one year from the previous six months. \nUnder a wet lease agreement, the aircraft owner supplies the aircraft and one crew member and also takes care of maintenance, insurance and attendant legal responsibilities of operation.   \nThe minister said that once the international hub was in place, it would be important to not only connect it with other international airports but also Tier-II and Tier-III airports within the country for enhanced connectivity. \nIf the minister’s plan comes to fruition, the country would not only offer an alternative to rival international aviation hubs such as Dubai and Singapore in Asia-Pacific but also make international fares from India more competitive. \n"}, {"title": "eRupee cannot be converted into cash for now: Report", "date": "Jan 19, 2023", "sub para": "<p><em><strong>Also read: <a href=\"https://www.businesstoday.in/latest/economy/story/digital-rupee-pilot-today-features-where-and-how-it-will-be-rolled-out-all-you-need-to-know-354856-2022-12-01\" target=\"_blank\">Digital Rupee pilot today: Features, where and how it will be rolled out; all you need to know</a></strong></em></p>", "link": "https://www.businesstoday.in/latest/economy/story/erupee-cannot-be-converted-into-cash-for-now-report-361089-2023-01-19", "para": "The central bank digital currency (CBDC) or the eRupee cannot be, currently, converted into cash and vice versa. eRupee will be issued against bank deposits only by the Reserve Bank of India (RBI). It will allow digital currency conversion into cash.  \nAddressing an event at the Indian Merchants’ Chamber, chief general manager at RBI’s fintech department Anuj Ranjan said that the pilot project has progressed quite satisfactorily in a closed-user group and that the number of users is gradually rising, according to a report in Times of India. Ranjan said that the apex bank will bear costs relating to eRupee as it is part of RBI’s liabilities.  \nLenders such as Yes Bank have already made the digital wallet available for download on the Apple App Store and Google Play Store. Several companies such as Reliance Retail, Natural Ice Cream and oil marketing companies have also signed up to accept payments in eRupee.  \nWHAT IS THE eRUPEE \nThe eRupee is a digital form of currency notes issued by a central bank. As per RBI, the motivations of issuance of CBDC are specific to different countries. The digital Rupee or e₹-R will present legal tender and the denominations will be the same as paper currency and coins. It will be distributed through intermediaries such as banks.   \nUsers will transact through a digital wallet, which can be stored on mobile phones and devices. Person-to-person and person-to-merchants transactions will be enabled, while QR codes can also be used for merchant payments.  \nThe first phase of the pilot began with four banks – State Bank of India, ICICI Bank, Yes Bank and IDFC First Bank. Mumbai, New Delhi, Bengaluru and Bhubaneswar saw the pilot roll out initially.  \nNone \n"}, {"title": "Davos 2023: EY projects India to become $26-trn economy by 2047 with six-fold increase in per capita income", "date": "Jan 18, 2023", "sub para": "<p><strong>Policy recommendations:</strong> Enhancing ease of doing business, accelerating power sector reforms and energy independence, and enabling quality healthcare and education will not only increase business confidence but also ensure socio-economic development on a sustained basis.<br/>\n </p>", "link": "https://www.businesstoday.in/latest/economy/story/davos-2023-ey-projects-india-to-become-26-trn-economy-by-2047-with-six-fold-increase-in-per-capita-income-360983-2023-01-18", "para": "Global consultancy firm EY on Wednesday announced its growth projection for India and estimated Indian economy will reach GDP size of $26 trillion by 2047, the 100th year of India’s independence. The per capita income is expected to increase to $15,000, putting the country among the ranks of developed economies, said EY. The report \"India@100: Realising the potential of a $26 trillion economy\", was launched by Ashwini Vaishnaw, Railway and IT Minister, on the sidelines of the World Economic Forum at Davos, Switzerland. \nThe report underscores the growth trajectory of the Indian economy that is projected to be the highest for any large economy over the coming decades. It also cites key enablers that will underpin the country’s development over the next 25 years that will unleash business opportunities across sectors and will significantly enhance India’s global competitiveness. It recommends ensuring macro-economic stability and resilience and continued thrust on reforms, which will be especially relevant in the backdrop of on-going geo-political conflicts, inflationary pressures and slowing global growth. \nLaunching the report, Vaishnaw said, “In line with Prime Minister Narendra Modi’s vision, India has commenced its journey into 'Amrit Kaal', a uniquely auspicious period, representing India’s opportunity to herald a new world era. There is an unparalleled impetus on developing world-class infrastructure supported by growth and investment-oriented policies and reforms to establish India as a manufacturing and technology hub. Over the next decade, India will not only be the fastest growing economy but will also play an integral role in leading the world into a sustainable future.” \nCarmine Di Sibio, Global Chairman and CEO, EY said: “As this study shows, India offers a unique investment opportunity as the world struggles with heightened consumer demands and increased geo-political pressures. With the biggest talent pool, an accelerated pace of economic reforms, breakthroughs in energy transition, and rapid digital transformation, the long-term growth trajectory is clearly positive. India demonstrates immense potential and is positioned to make a truly transformative impact on the world stage.” \nRajiv Memani, Chairman and Managing Partner, EY India said: “The entrepreneurial spirit of the private sector and policy measures of the last few years in the domains of fiscal, digital, physical infrastructure and social inclusion has uniquely positioned India for higher and sustainable growth. India is already among the fastest growing economy globally and is now at an inflection point where a new era of growth drivers will emerge. The next 25 years – the ‘Amrit Kaal’ – must bring an equal and strong focus on providing inclusive opportunities to all sections of the population, including women and those economically and socially disadvantaged.” \nUnder the most preferred scenario, India is likely to cross the critical thresholds of $5 trillion, $10 trillion and $20 trillion in market exchange rate terms in FY28, FY36 and FY45, respectively, show EY's projections.  \nGrowth enablers \nNone \nNone \nNone \nNone \nNone \nNone \nNone \n"}, {"title": "RBI cautions states against reverting to old pension scheme", "date": "Jan 17, 2023", "sub para": "<p>Committed expenditure, comprising interest payments, administrative services and pension, is expected to increase marginally from 2021-22 (RE), the report said. PTI NKD CS.</p>", "link": "https://www.businesstoday.in/latest/economy/story/rbi-cautions-states-against-reverting-to-old-pension-scheme-360710-2023-01-17", "para": "The Reserve Bank has sounded a note of caution on reversion to the old pension scheme by some states, saying it poses a major risk on the \"subnational fiscal horizon\" and would result in accumulation of unfunded liabilities in the coming years for them. \nThe observations in the RBI's Report titled 'State Finances: A Study of Budgets of 2022-23' comes in the backdrop of Congress-ruled Himachal Pradesh becoming the latest state announcing reverting to the Dearness Allowance (DA) linked Old Pension Scheme (OPS). \nEarlier, governments of Rajasthan, Chhattisgarh, and Jharkhand informed the central government and the Pension Fund Regulatory and Development Authority (PFRDA) about their decision to restart the OPS for their employees. \nThe government of Punjab on November 18, 2022 too had issued a notification regarding implementation of the OPS for the state government employees who are presently being covered under the NPS. \nIn 2004, the Union government came out with the National Pension System (NPS), a defined contribution pension scheme replacing the old pension scheme. \n\"A major risk looming large on the subnational fiscal horizon is the likely reversion to the old pension scheme by some states. The annual saving in fiscal resources that this move entails is short-lived,\" the RBI report said. \nBy postponing the current expenses to the future, the report said states risk the accumulation of unfunded pension liabilities in the coming years. \nUnder the old pension scheme, employees get a defined pension. Under this, an employee is entitled for a 50 per cent amount of the last drawn salary as pension. \nHowever, the pension amount is contributory under the National Pension System, which is in effect from 2004. \nSeveral economists too have expressed concern over reverting to the OPS saying it would put stress on states' finances. \nFormer Deputy Chairman of the erstwhile Planning Commission Montek Singh Ahluwalia recently spoke against bringing back the OPS, saying it is one of the biggest 'revadis'. \nFor 2022-23, the RBI report said states have budgeted an increase in revenue spending, mainly led by non-developmental expenditure such as pension and administrative services. \nBudget allocations towards medical and public health and natural calamities have been lowered, while housing outlay has been increased. \nCommitted expenditure, comprising interest payments, administrative services and pension, is expected to increase marginally from 2021-22 (RE), the report said. PTI NKD CS. \n"}, {"title": "India cuts windfall tax on crude, export taxes on aviation fuel and diesel", "date": "Jan 17, 2023", "sub para": "<p>The country in July imposed the windfall tax on crude oil producers and levies on exports of gasoline, diesel and aviation fuel after private refiners sought overseas markets to gain from robust refining margins, instead of selling more cheaply at home.</p>", "link": "https://www.businesstoday.in/latest/economy/story/india-cuts-windfall-tax-on-crude-export-taxes-on-aviation-fuel-and-diesel-360552-2023-01-17", "para": "India has cut its windfall tax on crude oil and exports of aviation turbine fuel (ATF) and diesel, according to a government notification dated Jan. 16. \nIt cut its windfall tax on crude to 1,900 rupees ($23.28) per tonne from 2,100 rupees per tonne, effective Tuesday. \nThe government also cut export tax on ATF to 3.5 rupees per litre from 4.5 rupees per litre, and cut export tax on diesel to 5 rupees per litre from 6.5 rupees per litre, the notification said. \nIndia, a major consumer and importer of oil, has been buying Russian crude at well below a $60 price cap agreed by the West. \nThe country in July imposed the windfall tax on crude oil producers and levies on exports of gasoline, diesel and aviation fuel after private refiners sought overseas markets to gain from robust refining margins, instead of selling more cheaply at home. \n"}, {"title": "India's exports in December 2022 dipped by 12.2%; trade deficit at $23.76 bn", "date": "Jan 16, 2023", "sub para": "<p>Russia has emerged as one of the top oil exporters to India since the war started as the Asian country lapped up discounts offered by Moscow, which has been under western sanctions.</p>", "link": "https://www.businesstoday.in/latest/economy/story/indias-exports-in-december-2022-dipped-by-122-360471-2023-01-16", "para": "India's merchandise trade deficit in December was largely flat at $23.76 billion compared with $23.89 billion in the previous month, according to a Reuters calculation based on export and import data released by the government on Monday. \nIndia's December merchandise exports rose to $34.48 billion from $31.99 billion in the previous month, and imports rose to $58.24 billion from $55.88 billion last month, according to government data. \nIndia's April-December exports rose 9.1% on year to $332.76 billion, while imports were up 25% to $551.7 billion, the government said. \nIndia's goods exports have been hit this year while high energy prices have led to a rise in imports, on the back of the ongoing war in Ukraine. \nIndia's April-December oil imports rose to $163.91 billion from $112.56 billion in the prior year, the government said. \nHowever, India sees new export markets growing for petroleum products from India in the Netherlands and Brazil, Sunil Barthwal, country's trade secretary told reporters. \n“Because of Russia-Ukraine war we were able to get crude oil at a much cheaper rate and we used our refining capacity to the hilt by refining it and then exporting,” Barthwal said. \nRussia has emerged as one of the top oil exporters to India since the war started as the Asian country lapped up discounts offered by Moscow, which has been under western sanctions. \n"}, {"title": "88% of India's ultra-wealthy individuals saw increase in wealth in 2022 despite global crises: Knight Frank’s Wealth Report", "date": "Jan 16, 2023", "sub para": "<p> “Real estate was the top cited opportunity among 46 per cent of Knight Frank’s survey respondents, whether for its attributes as an inflation hedge or due to the benefits of diversification. When investing directly, real estate enables greater control and value-add opportunities. One in ten respondents specifically cited looking for attractive valuations and distressed opportunities,” said Flora Harley, Partner, Residential Research at Knight Frank.  </p>", "link": "https://www.businesstoday.in/latest/economy/story/88-of-indias-ultra-wealthy-individuals-saw-increase-in-wealth-in-2022-despite-global-crises-knight-franks-wealth-report-360459-2023-01-16", "para": "Nine out of 10 ultra-high-net-worth individuals in India multiplied their wealth in 2022 much faster than their global counterparts, despite the global cost-of-living crisis and other factors, according to a new report from the real estate consultancy firm Knight Frank. The report highlighted that around 35 per cent of ultra-wealthy in India increased their total wealth by more than 10 per cent.   \nThe ultra-wealthy individuals invested 84 per cent of their investable wealth in equities, real estate, and bonds. The report noted that investments in commercial real estate, either directly or through funds and Real Estate Investment Trusts (REITS), were 25 per cent of their portfolios.  \n“As India emerges as a market of opportunity which is expected to remain in growth mode despite an impending global slowdown, wealth held by UHNWIs is expected to grow in 2023. The optimism of ultra-wealthy on wealth generation here is far higher than their global counterparts and this shall serve as the bedrock of investment and consumption decision,” said Shishir Baijal, Chairman and Managing Director at Knight Frank.   \nGlobally, the report noted that 40 per cent of ultra-wealthy individuals saw a rise in their wealth in 2022, whereas 15 per cent noted no change in wealth status in 2022 as against 2021.  \nReal estate appetite of Indians  \nThe report noted that in general Indian ultra-rich class own 5.1 residential properties compared to the global average of 4.2 units. They invested around 37 per cent of the total wealth in primary and secondary homes. Around 15 per cent of them were interested in residential properties outside India. UHNWIs in India have the greatest appetite, owning an average of five homes each.   \n“The Indian ultra-wealthy have also demonstrated a growing appetite for property compared to global averages and this bodes well for the real estate market. The tumultuous global macro-economic environment and high-interest rates will have its influence on market sentiments, however the new market phase with best-in-class real estate in residential and commercial segments is expected to witness continued demand,” added Baijal of Knight Frank.   \nAmong preferred foreign locations for ultra-rich Indians, the United Kingdom tops the list, followed by the United Arab Emirates and the United States.   \n “Real estate was the top cited opportunity among 46 per cent of Knight Frank’s survey respondents, whether for its attributes as an inflation hedge or due to the benefits of diversification. When investing directly, real estate enables greater control and value-add opportunities. One in ten respondents specifically cited looking for attractive valuations and distressed opportunities,” said Flora Harley, Partner, Residential Research at Knight Frank.   \n"}, {"title": "India's December WPI inflation eases to 4.95%", "date": "Jan 16, 2023", "sub para": "<p>December WPI inflation was lowest since February 2021, according to Refinitiv data.</p>", "link": "https://www.businesstoday.in/latest/economy/story/indias-december-wpi-inflation-eases-to-495-360436-2023-01-16", "para": "None \nThe Wholesale Price Index (WPI)-based inflation was 5.85 per cent in November 2022 and 14.27 per cent in December 2021. \nInflation in food articles was (-)1.25 per cent, while in fuel and power it was 18.09 per cent during December 2022. Inflation in manufactured products was 3.37 per cent during the month, the commerce and industry ministry said in a statement. \nNone \nNone \n\"Low manufacturing inflation is a reflection of cooling global commodity prices. This will continue as the world moves further to recession,\" said Madan Sabnavis, economist at Bank of Baroda. \nDecember WPI inflation was lowest since February 2021, according to Refinitiv data. \n"}, {"title": "BT Banking & Economy summit: Indian exports will get hit hard if firms don’t comply to global green norms, warn finance veterans", "date": "Jan 13, 2023", "sub para": "<p>Also read: <a href=\"https://www.businesstoday.in/latest/corporate/story/a-rating-system-for-fintech-firms-can-help-the-whole-financial-industry-says-ex-sbi-chairman-ak-purwar-360178-2023-01-13\">A rating system for fintech firms can help the whole financial industry, says ex-SBI chairman AK Purwar</a></p>", "link": "https://www.businesstoday.in/latest/economy/story/bt-banking-economy-summit-indian-exports-will-get-hit-hard-if-firms-dont-comply-to-global-green-norms-warn-finance-veterans-360182-2023-01-13", "para": "Indian exports across the board will get hit badly if companies in the country don’t comply with green requirements to tap into green and sustainable financing as western nations start coming up with carbon taxes to keep their own corporates competitive, said Vineet Rai, Founder and Managing Partner, Aavishkaar Capital, at the Business Today Banking & Economy Summit 2023 held in Mumbai on Friday.  \nThe role of banking and financing in mobilising capital more effectively towards projects and institutions working towards climate change has become more crucial as India has committed to achieving a net-zero carbon emission target by 2070. The country is estimated to need an estimated $7.5 trillion by 2070 and $1 trillion by 2030 to finance its goal.   \n“Europe is becoming very tough with its own corporates. Basically, western corporates are becoming uncompetitive and the countries come up with carbon taxes which will hit us hard. If you don’t comply, your exports will suffer soon because the world needs to have a level playing field and they will find their ways to do it,” Rai said at the session titled ‘Sustainable Finance in the Green Economy’.  \nSaying that government has woken up to it, he gave the example of how the Indian Green Hydrogen Policy is aimed at the big corporates. But it’s also an expensive proposition, he added. “The government will have to put in money, but we need to pull in a huge amount of capital,” he said. Pointing out that India alone needs $7.5 trillion by 2070 to finance its net zero target and about $170 billion currently, he said: “Roughly, $44 billion is what the country can provide. Around 13 per cent of the requirement will be met by overseas sources. After that, where will you get the remaining 75 per cent?”  \nThe other panelist Ankur Khurana, Managing Director, Corporate, Commercial and Institutional Banking, India, Standard Chartered Bank, pointed out that the change among Indian corporates to switch to renewables or solar power will not happen overnight.   \nExplaining how green financing actually works, she said approach towards assessing business to finance in – whether telecom towers or power or shipping and infra or ports — has changed in the last 3-4 years.  “What we encourage our large clients to do, and it’s already happening, is that do you have a transition plan? Are you willing to make investments to move to renewables? Are automobile firms looking at EV as a strategy?\" \nSaying that the process will involve a transition period, Khurana added: “A lot of international banks and institutions have drawn hardlines about not financing thermal power, though the last 12 months have thrown new challenges. But it is about both financial markets and conglomerates coming together and saying there is a transition, we need the money to get to that transition, which won’t happen overnight.”  \nNone \nNone \n"}, {"title": "MV Ganga Vilas to cost Rs 12.59 lakh for 51-day trip; PM Modi flags off world’s longest river cruise ", "date": "Jan 13, 2023", "sub para": "<p>Also read: <a href=\"https://www.businesstoday.in/visualstories/corporates/elon-musk-breaks-world-record-for-losing-most-personal-wealth-in-2022-making-him-fall-behind-lvmh-founder-bernard-arnault-17908-12-01-2023\" target=\"_blank\">Elon Musk breaks world record for losing most personal wealth in 2022</a></p>", "link": "https://www.businesstoday.in/latest/economy/story/mv-ganga-vilas-to-cost-rs-1259-lakh-for-51-day-trip-pm-modi-flags-off-worlds-longest-river-cruise-360066-2023-01-13", "para": "It would cost you over Rs 12.59 lakh for a 51-day trip to take the world’s longest river cruise MV Ganga Vilas from Varanasi to Dibrugarh. The ticket price per person per day is Rs 24,962.25 or $300, according to Shipping and Waterways Minister Sarbananda Sonowal. Tickets for the Ganga Vilas cruise can be booked via the Antara Cruises website, the company that operates the Ganga Vilas cruise.  \nPrime Minister Narendra Modi has flagged off the world’s longest river cruise MV Ganga Vilas today via video conferencing. He also inaugurated the Varanasi Tent City. The 51-day-long cruise will cover 50 tourist spots including world heritage sites, national parks, river ghats, and major cities. According to a PMO release, this cruise will “herald a new age of river cruise tourism for India” and is in line with the Prime Minister’s endeavour to boost river cruise tourism.  \nDetails about Ganga Vilas capacity, itinerary, travel duration, and more  \n1. The MV Ganga Vilas cruise has three decks and 18 suites on board with a capacity of 36 tourists.  \n2. During its 51-day trip, the cruise will begin its journey from Varanasi and travel around 3,200 km to reach Dibrugarh via Bangladesh.  \n3. This trip encompasses a total of 27 river systems of UP, Bihar, West Bengal, Bangladesh, and Assam and also 3 major rivers– Ganga, Brahmaputra, and Meghna.  \n4. In Bengal, the Ganga Vilas cruise will enter five river systems– Bhagirathi, Hooghly, Malata, Bidyavati, and Sundarbans.  \n5. The world’s largest river cruise will pass through Meghna, Padma and Jamuna in Bangladesh and then enter the Brahmaputra in Assam.  \n6. The Ganga Vilas route also includes major cities like Patna (Bihar), Sahibganj (Jharkhand), Kolkata (West Bengal), Dhaka (Bangladesh) and Guwahati (Assam).  \n7. Travellers will also get to visit the Bihar School of Yoga and Vikramshila University.  \n8. The opulent 62.5 m long, 12.8 m wide, and 1.35 m deep cruise offers travellers all the required amenities.  \n9. These amenities include life vests, smoke alarms, sprinklers, a bathroom with a shower, convertible beds, an LED TV, a safe, and a French balcony. \n10, Eight river cruise vessels are operational between Kolkata and Varanasi and cruise movement is also operational on National Waterways 2 (Brahmaputra).  \nNone \nNone \n"}]