[
  {
    "title": "Chalet Hotels spikes 6% in afternoon trade on healthy earnings growth for Q3",
    "date": "2023-01-24 18:26:42.691885",
    "sub para": "<p>The stock is trading well above all important moving averages, indicating positive mood among participants.</p>",
    "article para": "Find & Invest in bonds issued by top corporates, PSU Banks, NBFCs, and much more. Invest as low as 10,000 and earn better returns than FD \nFind safe & high-yielding bonds for your buck. Discover the right bonds meeting your investment amount & investment horizon \nCurated markets data, exclusive trading recommendations, Independent equity analysis & actionable investment ideas \nCurated markets data, exclusive trading recommendations, Independent equity analysis & actionable investment ideas \nThe stock traded at Rs 362 on the NSE at 2:19pm, keeping up its northward journey for the fourth consecutive session. \nThe hotel chain operator has clocked a consolidated profit of Rs 102.3 crore for the December quarter, against a loss of Rs 14.6 crore in the corresponding period last fiscal, and a significant increase from profit of Rs 15.7 crore reported in the previous quarter. \nThe growth in numbers were driven by a healthy topline as well as operating performance. Higher other income also boosted profitability. \nConsolidated revenue from operations at Rs 289.7 crore for the quarter grew by 76.5 percent over the same period last fiscal, the K Raheja Corp group company said in its exchange filing on January 24. \nAt the operating level, EBITDA (earnings before interest, tax, depreciation and amortisation) surged nearly three-fold to Rs 113.5 crore for the December FY23 quarter, up from Rs 40.4 crore last fiscal. Operating profit margin at 39.2 percent for the quarter expanded by more than 14 percentage basis points over year-ago period. \nThe stock has seen formation of a long, bullish candlestick pattern on the daily charts with significantly higher volumes for the second straight day. It has been making a higher-high-higher-low formation for the third straight session, with the momentum oscillator RSI (relative strength index - 14) around 64 level, indicating positive mood in the counter. \nThe stock gathered momentum after crossing its 20 DMA (simple moving average) on Tuesday, with the Bollinger band expansion indicating increased price movement and an upward trend. \nIt has decisively broken the Mother candle range on the upper side formed on January 5 with breaking-out downward sloping resistance trend line adjoining highs of November 7, 2022 and January 23, 2023 while taking support of 200 DEMA (day exponential moving average). \nThe stock is trading well above all important moving averages, indicating positive mood among participants. \n"
  },
  {
    "title": "PVR, INOX shares rise as excitement over SRK’s comeback film 'Pathaan' runs high",
    "date": "2023-01-24 18:26:43.006119",
    "sub para": "<p><em class=\"hidep\" style=\"display:none\">Disclaimer: The views and investment tips expressed by investment experts on Moneycontrol.com are their own and not those of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions.​​​​​​​​​​​</em></p>",
    "article para": "Find & Invest in bonds issued by top corporates, PSU Banks, NBFCs, and much more. Invest as low as 10,000 and earn better returns than FD \nFind safe & high-yielding bonds for your buck. Discover the right bonds meeting your investment amount & investment horizon \nCurated markets data, exclusive trading recommendations, Independent equity analysis & actionable investment ideas \nCurated markets data, exclusive trading recommendations, Independent equity analysis & actionable investment ideas \nThe firm expects about Rs 150-200 crore India collections in first week of release, given the three holidays, social media buzz, and \"pent-up demand for SRK\". \nFor the October-December quarter, PVR posted a consolidated net profit of Rs 16.1 crore against a loss of Rs 10 crore in the year-ago period. Revenue from operations surged 53 percent on-year to Rs 941 crore from Rs 614 crore a year back. \nAccording to Nuvama, the PVR stock is in the oversold territory, down over 30 percent from its peak. It has the 'buy' rating on the stock with a target price of Rs 2,110 per share. \nPrabhudas Lilladher has a target price of Rs 1,983 on the stock. It believes that the proposed merger with Inox is expected to culminate in Q4 FY23 and can act as a key re-rating lever. It expects margins to improve, led by increased footfalls and recovery of ad revenues. \nDisclaimer: The views and investment tips expressed by investment experts on Moneycontrol.com are their own and not those of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions.​​​​​​​​​​​ \n"
  },
  {
    "title": "Tata Communications shares down 4% after Q3 earnings disappoint Street",
    "date": "2023-01-24 18:26:43.341045",
    "sub para": "<p><strong>Also Read | <a href=\"https://www.moneycontrol.com/news/business/budget/budget-2023-govt-expected-to-up-the-ante-on-domestic-defence-manufacturing-9924911.html\" rel=\"dofollow\">Budget 2023: Govt expected to up the ante on domestic defence manufacturing</a></strong></p>",
    "article para": "Find & Invest in bonds issued by top corporates, PSU Banks, NBFCs, and much more. Invest as low as 10,000 and earn better returns than FD \nFind safe & high-yielding bonds for your buck. Discover the right bonds meeting your investment amount & investment horizon \nCurated markets data, exclusive trading recommendations, Independent equity analysis & actionable investment ideas \nCurated markets data, exclusive trading recommendations, Independent equity analysis & actionable investment ideas \nTata Communications share price suffered over 4 percent erosion on January 24 after the company’s earnings disappointed the Street. \nAt 11:47am, shares of the communications company were trading at Rs 1329.95, down 3.8 percent, on the BSE. \nThe company posted a consolidated net profit of about Rs 394 crore for the quarter ended December. It had reported a profit of Rs 532.29 crore in the previous quarter and Rs 395.21 crore a year ago. \nIts income from operations for the reporting quarter increased to Rs 4,528.34 crore from last year’s Rs 4,184.89 crore. In the September quarter, the company had reported a profit of Rs 4,430.74 crore. \nSegment wise, only voice solutions witnessed a decline in revenue growth. Whereas data services, payment solutions, transformation services, and real estate witnessed growth in revenues. \nMotilal Oswal Financial Services pointed out that free cash flow reduced by 45 percent sequentially to Rs 3.5 billion from Rs 6.2 billion in the second quarter of FY23. \nThe Tata Group company enables digital transformation of enterprises globally with collaboration and connected solutions, core and next-gen connectivity, cloud hosting and security solutions and media services. \n"
  },
  {
    "title": "CONCOR shares shed over 2% despite rise in Q3 profit; Nomura sees 31% upside",
    "date": "2023-01-24 18:26:44.283860",
    "sub para": "<p><em class=\"hidep\" style=\"display:none\">Disclaimer: The views and investment tips expressed by experts on Moneycontrol are their own and not those of the website or its management. Moneycontrol advises users to check with certified experts before taking any investment decisions.​</em></p>",
    "article para": "Find & Invest in bonds issued by top corporates, PSU Banks, NBFCs, and much more. Invest as low as 10,000 and earn better returns than FD \nFind safe & high-yielding bonds for your buck. Discover the right bonds meeting your investment amount & investment horizon \nCurated markets data, exclusive trading recommendations, Independent equity analysis & actionable investment ideas \nCurated markets data, exclusive trading recommendations, Independent equity analysis & actionable investment ideas \nIn the year-ago period, CONCOR had reported a net profit of Rs 287 crore. Sequentially, the profit after tax has declined in the December 2022 quarter, as it stood at Rs 302.80 crore in Q2 FY23. \nAt 9:48am, Container Corporation was quoting at Rs 681.00, down Rs 20.00, or 2.85 percent, on the BSE. It has touched an intraday high of Rs 692 and an intraday low of Rs 676.75. \nCONCOR's revenue climbed 3.6 percent in the third quarter, rising from Rs 1,920 crore a year ago to Rs 1,988.4 crore. The numbers were also higher sequentially, as revenue in the September 2022 quarter stood at Rs 1,970.6 crore. \nThe firm reported an earnings before interest, taxes, depreciation and amortisation (EBIDTA) of Rs 426.4 crore in Q3 FY23, which was 14.1 percent higher than Rs 373.8 crore clocked a year back. The company's margin was up 21.4 percent in the December 2022 quarter as against 19.5 percent in the previous year. \nApart from releasing the quarterly results, CONCOR informed the stock exchanges that its board has cleared a third interim dividend for FY23 of 80 percent or Rs 4 per equity share of a face value of Rs 5 each, amounting to Rs 243.72 crore. \nGlobal research firm Nomura has a 'buy' rating on the stock with target at Rs 895 per share, an upside of over 31 percent from the current market price. It is of the view that Q3 revenue and EBITDA missed estimates, but EXIM profitability and LLF was largely in-line. \n\"Sales was a miss as realisations, especially EXIM was below estimates. EBITDA margin miss was largely led by weakness in domestic profitability, while we await management commentary on weak domestic profitability and market share loss and to any update on divestment,\" the brokerage firm said. \nDisclaimer: The views and investment tips expressed by experts on Moneycontrol are their own and not those of the website or its management. Moneycontrol advises users to check with certified experts before taking any investment decisions.​ \n"
  },
  {
    "title": "Welspun Corp shares rise nearly 4% after bagging contracts in Saudi Arabia",
    "date": "2023-01-24 18:26:45.156108",
    "sub para": "<p>At 9:54am, Welspun Corp was quoting at Rs 230.40, up Rs 5.20, or 2.31 percent, on the BSE.</p>",
    "article para": "Find & Invest in bonds issued by top corporates, PSU Banks, NBFCs, and much more. Invest as low as 10,000 and earn better returns than FD \nFind safe & high-yielding bonds for your buck. Discover the right bonds meeting your investment amount & investment horizon \nCurated markets data, exclusive trading recommendations, Independent equity analysis & actionable investment ideas \nCurated markets data, exclusive trading recommendations, Independent equity analysis & actionable investment ideas \nWelspun Corp shares climbed nearly 4 percent intraday on January 24 after an associate company wins contracts worth SAR 569 million in Saudi Arabia. \nMultiple contracts sign off with NEOM with a total value of around SAR 373 million inclusive of value added tax. \nThe pipes have to be supplied within 12 months and the financial impact of this will be starting in Quarter 1 of FY2023 -24. \nThe company also sign off contract with Petrojet Co with total value of around SAR 196 million inclusive value added tax. \nEPIC is Saudi Arabia’s leading manufacturer of Helical Submerged Arc Welded (HSAW) pipes. Its fully integrated manufacturing facilities, track record of effective execution, and technological knowhow, enable it to remain well-placed to secure further projects both in the water and oil and gas sector. \nThe share touched a 52-week high Rs 298.35 and a 52-week low Rs 135.55 on September 22, 2022 and March 7, 2022. It is trading 22.56 percent below its 52-week high and 70.45 percent above its 52-week low. \n"
  },
  {
    "title": "Gland Pharma shares hit 52-week low after profit declines 15% in Q3",
    "date": "2023-01-24 18:26:45.856797",
    "sub para": "<p><em class=\"hidep\" style=\"display:none\">Disclaimer: The views and investment tips expressed by experts on Moneycontrol.com are their own and not those of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions.</em></p>",
    "article para": "Find & Invest in bonds issued by top corporates, PSU Banks, NBFCs, and much more. Invest as low as 10,000 and earn better returns than FD \nFind safe & high-yielding bonds for your buck. Discover the right bonds meeting your investment amount & investment horizon \nCurated markets data, exclusive trading recommendations, Independent equity analysis & actionable investment ideas \nCurated markets data, exclusive trading recommendations, Independent equity analysis & actionable investment ideas \nGland Pharma share price fell 4 percent and touched 52-week low in the early trade on January 24 after the company posted a weak set of numbers for the quarter ended December 2022. \nRevenue from operations for the quarter at Rs 938 crore declined 12 percent compared to year-ago period. \nGland Pharma has touched 52-week low of Rs 1,309 and quoting at Rs 1,320, down Rs 57.35, or 4.16 percent on the BSE. \nThe brokerage house cut its EPS estimates by 10 percent/12 percent/11 percent for FY23/FY24/FY25 and lower the PE multiple to 22x from 24x \nConsidering the near-term business headwinds, it expects a 22 percent earnings decline YoY in FY23. However, with the resolution of issues, a better business outlook for biologics/China and the addition of Cenexi's business, it expect a 17 percent earnings CAGR over FY23-25. \nThe 58 percent fall in the stock price in the past one year already factors in the deterioration in the business outlook. \nGland Pharma’s third quarter results missed the research house and consensus estimates mainly due to persistent supply chain constrains and slowdown in demand. \nApart from these, increased competition is also likely to affect growth as the company is ready to sacrifice growth for margins. Nirmal Bang turned cautious due to persistent supply chain issues, inventory rationalisation at clients’ level and increased competition. \nThe research firm has kept the ‘outperform’ rating and cut the target price to Rs 2,036 per share as the Q3 earnings were a miss, while management is cautiously optimistic about FY24. \nThe revenue impacted by ongoing supply issues and inventory correction at partners. Also, lower off-take of new launches led to contraction in revenue. However, the gross margin is improved. \nThe management believes profit share is sustainable & margin levels can be maintained, reported CNBC-TV18. \nDisclaimer: The views and investment tips expressed by experts on Moneycontrol.com are their own and not those of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions. \n"
  },
  {
    "title": "Buzzing Stocks: Maruti Suzuki, Axis Bank, NBCC, and others in news today",
    "date": "2023-01-24 18:26:46.180573",
    "sub para": "<p class=\"MT5\"><span class=\"mcp_btn_blue_tp\" title=\"Subscribe\">Subscribe</span></p>",
    "article para": "Find & Invest in bonds issued by top corporates, PSU Banks, NBFCs, and much more. Invest as low as 10,000 and earn better returns than FD \nFind safe & high-yielding bonds for your buck. Discover the right bonds meeting your investment amount & investment horizon \nCurated markets data, exclusive trading recommendations, Independent equity analysis & actionable investment ideas \nCurated markets data, exclusive trading recommendations, Independent equity analysis & actionable investment ideas \n"
  },
  {
    "title": "Gainers & Losers: 10 stocks that moved the most on January 23",
    "date": "2023-01-24 18:26:47.059776",
    "sub para": "<p class=\"MT5\"><span class=\"mcp_btn_blue_tp\" title=\"Subscribe\">Subscribe</span></p>",
    "article para": "Find & Invest in bonds issued by top corporates, PSU Banks, NBFCs, and much more. Invest as low as 10,000 and earn better returns than FD \nFind safe & high-yielding bonds for your buck. Discover the right bonds meeting your investment amount & investment horizon \nCurated markets data, exclusive trading recommendations, Independent equity analysis & actionable investment ideas \nCurated markets data, exclusive trading recommendations, Independent equity analysis & actionable investment ideas \n"
  },
  {
    "title": "Indoco Remedies shares gain even as USFDA inspection ends with 9 observations",
    "date": "2023-01-24 18:26:47.873468",
    "sub para": "<p><em class=\"hidep\" style=\"display:none\">Disclaimer: The views and investment tips expressed by investment experts on Moneycontrol.com are their own and not those of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions.</em></p>",
    "article para": "Find & Invest in bonds issued by top corporates, PSU Banks, NBFCs, and much more. Invest as low as 10,000 and earn better returns than FD \nFind safe & high-yielding bonds for your buck. Discover the right bonds meeting your investment amount & investment horizon \nCurated markets data, exclusive trading recommendations, Independent equity analysis & actionable investment ideas \nCurated markets data, exclusive trading recommendations, Independent equity analysis & actionable investment ideas \n“The USFDA has conducted a GMP (good manufacturing practices) inspection of the Solid Oral Formulation Facility (Plant 1) at Goa. The inspection was conducted from January 16 to January 20,” Indoco said in an exchange filing. \nThe company added that the USFDA issued Form 483 with nine observations, which will be addressed within the stipulated time. \nAn FDA Form 483 is issued to firm management at the conclusion of an inspection when investigators observe any conditions that in their judgement may constitute violations of the US’ Food Drug and Cosmetic (FD&C) Act and related Acts. \nThe FDA says companies are encouraged to respond to the FDA Form 483 in writing with their corrective action plan and then implement that corrective action plan expeditiously. \nSome observations can be negative for the company and others just procedural, which can be resolved without much difficulty. The company, however, did not reveal the nature of observations. \n“We believe that this will not have an impact on the supplies and the existing revenues from this facility,” the company added. \nPrabhudas Lilladher, which has a 'buy' rating on the stock with a target price of Rs 430, said it expects the company’s margins to recover, led by softening of input prices and scale up of revenues. \n“Domestic market continues to grow. We remain structurally positive on Indoco Remedies’ growth prospects given (1) MR productivity enhancement and higher penetration in North and East markets, (2) new launches in the US, and (3) higher tender business in EU market,” it said. \nICICIdirect has a target price of Rs 465 with a 'buy' rating. The broker said steady domestic business visibility, strong exports guidance and expected improvement in margins are key likely drivers for the stock \nDisclaimer: The views and investment tips expressed by investment experts on Moneycontrol.com are their own and not those of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions. \n"
  },
  {
    "title": "Nykaa shares tumble 20% so far in this month; analysts find valuation ‘palatable’",
    "date": "2023-01-24 18:26:48.737413",
    "sub para": "<p><em class=\"hidep\" style=\"display:none\">Disclaimer: The views and investment tips expressed by investment experts on Moneycontrol.com are their own and not those of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions.</em></p>",
    "article para": "Find & Invest in bonds issued by top corporates, PSU Banks, NBFCs, and much more. Invest as low as 10,000 and earn better returns than FD \nFind safe & high-yielding bonds for your buck. Discover the right bonds meeting your investment amount & investment horizon \nCurated markets data, exclusive trading recommendations, Independent equity analysis & actionable investment ideas \nCurated markets data, exclusive trading recommendations, Independent equity analysis & actionable investment ideas \nOn the BSE, it traded down over 2 percent to Rs 124 as of 12 noon. The stock hit an all-time low of Rs 120.75 during the day as well, but saw some recovery as low levels. The stock is down 62 percent last year. \nThe stock has been on a decline ever since the lock-in period for pre-IPO investors and the company brought a bonus issue to stabilise the share price. \nBut now, some analysts have started upgrading their rating on the stock as prices have fallen a lot and valuation is turning favourable. \n“We had always liked Nykaa's business model,” said Manoj Menon, an analyst at ICICI Securities. “That said, after its listing on the Indian bourses, we've been staying on the sidelines due to valuations beyond our ability to comprehend.” \nThe analyst upgraded the stock to 'add' (from 'hold') with revised DCF-based target price of Rs 145 (from Rs 175 earlier), adding valuation was turning palatable now. He sees some key risks to his call. They include chasing growth at elevated levels that can dilute gross margin, and success in fashion business can be difficult given higher competition in the category. \nA few others have also seen opportunity in crisis. “(The) stock has corrected partly due to the global tech sell-off on rising yields and more recently due to the lock-in expiry on November 10, 2022,” said Amit Sachdeva, an analyst at HSBC Securities, in a recent report. \n“We believe valuations are now even more appealing and under-appreciate the structural growth opportunity in beauty and personal care.” \nDisclaimer: The views and investment tips expressed by investment experts on Moneycontrol.com are their own and not those of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions. \n"
  },
  {
    "title": "UltraTech Cement top loser after Q3 profit falls 37% but Morgan Stanley still sees 21% upside",
    "date": "2023-01-24 18:26:49.323203",
    "sub para": "<p><strong>Disclaimer:</strong> <em class=\"hidep\" style=\"display:none\">The views and investment tips expressed by experts on Moneycontrol are their own and not those of the website or its management. Moneycontrol advises users to check with certified experts before taking any investment decisions.​</em></p>",
    "article para": "Find & Invest in bonds issued by top corporates, PSU Banks, NBFCs, and much more. Invest as low as 10,000 and earn better returns than FD \nFind safe & high-yielding bonds for your buck. Discover the right bonds meeting your investment amount & investment horizon \nCurated markets data, exclusive trading recommendations, Independent equity analysis & actionable investment ideas \nCurated markets data, exclusive trading recommendations, Independent equity analysis & actionable investment ideas \nWhile the profit missed estimates, revenue was higher than expected. According to a brokerage poll conducted by Moneycontrol, net profit was seen at Rs 1,105.2 crore and consolidated revenue at Rs 15,191.5 crore. \nAt 10.54 am, UltraTech Cement was quoting at Rs 6,997.65, down Rs 180.60, or 2.52 percent, on BSE. It touched an intraday high of Rs 7,180.75 and an intraday low of Rs 6,980. \nGlobal research firm CLSA has an \"outperform\" rating on the stock with the target at Rs 7,800 a share, an upside of over 11 percent from the current level. \nIt is of the view that Q3 EBITDA was largely in-line with estimates while it believes that the results were largely mixed. Outlook for the fourth quarter and beyond would the key, it said. \n\"Volume growth was encouraging, while flat realisation disappointed. Increase in profitability was led by benefits of operating leverage on higher volume,\" it said. \nJefferies has a \"buy\" rating with the target at Rs 8,300 a share, an upside of more than 18 percent from the current market price. The global brokerage firm believes that consolidated EBITDA was near expectations. \n\"Sales volume growth was broad-based, while realisation growth was lower than estimates. Cost growth was moderately higher against estimates. Cost growth likely reflects high cost inventory remaining even as spot fuel costs are sliding,\" it said. \nMorgan Stanley has an “overweight” call with the target at Rs 8,500 per share, an upside of 21 percent from the current level. \nIt is of the view that EBITDA was in-line with consensus, with the key positives being volumes and realisations, partially offset by higher operating expenses. It prefers the company based on multi-year demand upcycle expectations and return ratios. \n"
  },
  {
    "title": "JSW Energy down 4% after Dec quarter profit tanks to Rs 180 crore, HDFC Sec retains 'sell'",
    "date": "2023-01-24 18:26:49.784035",
    "sub para": "<p><em class=\"hidep\" style=\"display:none\">Disclaimer: The views and investment tips expressed by experts on Moneycontrol are their own and not those of the website or its management. Moneycontrol advises users to check with certified experts before taking any investment decisions.​</em></p>",
    "article para": "Find & Invest in bonds issued by top corporates, PSU Banks, NBFCs, and much more. Invest as low as 10,000 and earn better returns than FD \nFind safe & high-yielding bonds for your buck. Discover the right bonds meeting your investment amount & investment horizon \nCurated markets data, exclusive trading recommendations, Independent equity analysis & actionable investment ideas \nCurated markets data, exclusive trading recommendations, Independent equity analysis & actionable investment ideas \nJSW Energy stated that during the October-December 2022 quarter, its total revenue increased 18 percent to Rs 2,350 crore from Rs 1,984 crore a year ago due to higher realisation as higher fuel costs are passed through in nature for long term power purchase agreements (LT PPA). \nThe EBITDA for the quarter was 18 percent lower at Rs 727 crore vis-à-vis Rs 882 crore in the corresponding period of the previous year. \nFinance costs during the quarter increased by 9 percent to Rs 214 crore due to additional borrowings (for ongoing growth capex) and an increase in weighted average cost of debt to 8.29 percent with the rising rates cycle. \nAt 10:36am, JSW Energy was quoting at Rs 249.90, down Rs 12.30, or 4.69 percent, on the BSE. It has touched an intraday high of Rs 256.00 and an intraday low of Rs 246. \nAccording to HDFC Securities, JSW Energy's Q3 FY23 sales were 10 percent above the consensus estimate at Rs 22.5 billion (+18.7 percent YoY), driven by higher blended realisation, which was up 30.3 percent YoY to Rs 5.5 per unit. Net generation, however, declined 4.8 percent YoY to 4.3 billion due to a relatively weaker merchant market as coal prices increased by 37 percent YoY to $227 per tonne during the quarter. \n\"Acquisition of Mytrah Energy is expected to be completed in Q4 FY23 (delayed by a quarter), which along with the phase-wise commissioning of SECI IX-810MW and X-450 MW will take the total operational capacity to 9.1GW by FY24. Further, JSW Energy completed the acquisition of the Utkal Ind-Bharath project having 700MW capacity pursuant to NCLT under IBC whose project revival plan is in progress and commissioning is expected in the next 24 months. \n\"JSW Energy is generating Rs 24-25 billion per annum in cash profit, which is sufficient to fund its pipeline projects and aims to maintain the debt/EBITDA level below 4-5x. However, the valuation looks expensive at Rs 262 (RoE - ~8.9 percent, FY25 P/E – 23.6x, P/BV - 2.0x). Thus, we maintain sell with a stop loss target price of Rs 186,\" he said. \nDisclaimer: The views and investment tips expressed by experts on Moneycontrol are their own and not those of the website or its management. Moneycontrol advises users to check with certified experts before taking any investment decisions.​ \n"
  },
  {
    "title": "Bandhan Bank jumps after research firms tag stock with 'buy' rating, with 42% upside",
    "date": "2023-01-24 18:26:50.627758",
    "sub para": "<p><em class=\"hidep\" style=\"display:none\">Disclaimer: The views and investment tips expressed by experts on Moneycontrol are their own and not those of the website or its management. Moneycontrol advises users to check with certified experts before taking any investment decisions.​</em></p>",
    "article para": "Find & Invest in bonds issued by top corporates, PSU Banks, NBFCs, and much more. Invest as low as 10,000 and earn better returns than FD \nFind safe & high-yielding bonds for your buck. Discover the right bonds meeting your investment amount & investment horizon \nCurated markets data, exclusive trading recommendations, Independent equity analysis & actionable investment ideas \nCurated markets data, exclusive trading recommendations, Independent equity analysis & actionable investment ideas \nAt 9:40am, Bandhan Bank was quoting at Rs 248.00, up Rs 10.95, or 4.62 percent, on the BSE. It has touched an intraday high of Rs 249 and an intraday low of Rs 239.85. \nNet Interest Income (NII) or the income a bank earns by giving loans, fell marginally by 2.1 percent YoY to Rs 2,080.43 crore. Other income increased nearly 45.74 percent YoY to Rs 1,033.30 crore. \nThe lender's non-performing assets improved. Gross non-performing assets (GNPAs) fell 26.23 percent to Rs 6,964.76 crore as against Rs 9,441.57 crore logged in the same quarter of the previous year. \nGlobal research firm JP Morgan has an 'overweight' rating on the stock with target at Rs 350 per share, an upside of over 42 percent from the current market price. The brokerage firm believes that Q3 numbers were in-line while the key positive was sharp moderation in slippages outside watchlist. \n\"Over 90 percent of slippages were flows from stress book where bank has high coverage. Overall MFI stress book was lower than guided in December 2022 analyst meet. The bank's collection efficiency has largely moved back to pre-Covid levels. \nCLSA has a 'buy' call on the stock with target at Rs 320 per share. The brokerage firm is of the view that NII missed estimates and overall performance was muted while SMA book and un-provided stress were down. \n\"MFI asset quality will be back on track in Q4 leading to a normalised Return on equity (RoE). We have cut FY24-25 estimates by 4-6 percent to factor in slower balance sheet growth while confidence in a cyclical MFI recovery increases,\" it said. \nJefferies also has a 'buy' rating on Bandhan Bank with target at Rs 340 per share. The global research firm is of the view that Q3 was tad better with profit, while slippages and credit costs were key drags. It expects normalisation of credit costs to drive rebound in earnings/RoE. \n\"Lending rate hikes can lift NIMs in H2 and could see sustainable improvement in CASA growth. Valuations are attractive and can re-rate as RoE reverts to 20 percent,\" Jefferies said. \nDisclaimer: The views and investment tips expressed by experts on Moneycontrol are their own and not those of the website or its management. Moneycontrol advises users to check with certified experts before taking any investment decisions.​ \n"
  },
  {
    "title": "Reliance Industries reports Q3 results: What should investors do now?",
    "date": "2023-01-24 18:26:51.307803",
    "sub para": "<p><em class=\"hidep\" style=\"display:none\">Disclaimer: The views and investment tips expressed by experts on Moneycontrol.com are their own and not those of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions.</em></p>",
    "article para": "Find & Invest in bonds issued by top corporates, PSU Banks, NBFCs, and much more. Invest as low as 10,000 and earn better returns than FD \nFind safe & high-yielding bonds for your buck. Discover the right bonds meeting your investment amount & investment horizon \nCurated markets data, exclusive trading recommendations, Independent equity analysis & actionable investment ideas \nCurated markets data, exclusive trading recommendations, Independent equity analysis & actionable investment ideas \nIts consolidated net profit for the quarter stood at Rs 17,806 crore, down 13.30 percent year-on-year (YoY). \nCompany officials said higher finance costs were due to interest rate hikes by central banks and higher loan balances. \nThe broking house cut FY23-25E earnings by 4 percent/0.3 percent to factor in 1) higher finance charges due to rising interest rates 2) lower other income and 3) higher tax charges due to lower tax credits. \nThe Q3 benefitted from strong refining performance offset from lower throughput due to planned maintenance along with weak polymer and polyester margins. \nRetail segment saw healthy growth as outlets operated normally, while Jio reported steady performance given no tariff hikes and customer additions (+1.2 percent QoQ). \nBrokerage house revise its capex estimates for FY23/FY24 to Rs 1,700 billion /Rs 1,000 billion from Rs 1,650 billion/Rs 750 billion, respectively, building in Rs 1,262 billion/Rs 280 billion in telecom, Rs 350 billion/Rs 350 billion in the standalone business and the rest in others. \nUsing SOTP, broking firm value the refining and petrochemical segment at 7.5x on December 24 EV/EBITDA to arrive at our valuation of Rs 879/share for the standalone business. \nIt ascribe an equity valuation of Rs 809/share to RJio and Rs 1,270/share to Reliance Retail, factoring in the recent stake sale. \nThe research firm has maintained ‘buy’ rating on the stock with a target at Rs 2,850 per share amid robust O2C performance and healthy consumer business. \nResearch firm cut FY23 EPS forecast by 6 percent and retain FY24-25 EPS on factoring lower Jio EBITDA and FY24-25 EPS is partly offset by higher O2C and upstream, reported CNBC-TV18. \nBrokerage house has kept ‘buy’ rating on the stock with a target at Rs 3,110 per share with EBITDA beat in O2C and Jio, while retail was in-line. \nStrong store additions and improving footfalls paint a strong growth outlook in FY24. However, Jio's sub additions were a tad lower, but rapid 5G Roll-out should drive strong growth. \nO2C benefited from strong diesel spreads and cheap crude blending and Chinese demand recovery can lead to earnings upside in FY24. \nBroking house has kept ‘overweight’ rating on the stock with a target at Rs 3,015 per share as the EBITDA, PAT beat driven by sharp O2C jump. \nDisclaimer: The views and investment tips expressed by experts on Moneycontrol.com are their own and not those of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions. \n"
  },
  {
    "title": "Kotak Mahindra Bank posts 31% spike in Q3 net: What should you do with the stock?",
    "date": "2023-01-24 18:26:52.103514",
    "sub para": "<p><em class=\"hidep\" style=\"display:none\">Disclaimer: The views and investment tips expressed by experts on Moneycontrol.com are their own and not those of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions.</em></p>",
    "article para": "Find & Invest in bonds issued by top corporates, PSU Banks, NBFCs, and much more. Invest as low as 10,000 and earn better returns than FD \nFind safe & high-yielding bonds for your buck. Discover the right bonds meeting your investment amount & investment horizon \nCurated markets data, exclusive trading recommendations, Independent equity analysis & actionable investment ideas \nCurated markets data, exclusive trading recommendations, Independent equity analysis & actionable investment ideas \nThe bank's net interest income surged 30 percent to Rs 5,653 crore in the December quarter as against Rs 4,334 crore in the same quarter a year back. \nThe spike in NII comes on the back of a year-on-year growth of 23 percent in loans and a jump in net interest margin to 5.47 percent from 4.62 percent. \nThe bank saw a strong quarter as core earnings at Rs 26 billion, beating broking house estimates by 6 percent driven by higher NIM at 5.43 percent (PLe 5.2 percent) which was a function of lower cost of funds that came in at 3.83 percent (PLe 4.1 percent). \nCredit growth was a tad higher at 5.7 percent QoQ driven by corporate (+6.8 percent) and retail (+6.0 percent). \nWith continued traction in PL/CC and MFI, bank expects unsecured share to increase from 9.3 percent to early-mid teens in FY24 which would also protect margins. \nBroking firm has maintained ‘Outperform’ rating on the stocks with a target at Rs 2,080 per share as the Q3 was robust with a big NII beat and growth remains strong. \nThe management confident in delivering an increasing share of unsecured book at a fast clip, while clarity on CEO transition & improving retail liability accretion will be key, reported CNBC-TV18. \nThe strong margin expansion driven by healthy credit growth & continued loan mix shift and healthy Q3 EPS growth driven by a healthy credit growth and significant margin expansion. \nThe surge in retail segments and micro-finance helped credit growth and margin expansion and NII growth and normalisation of treasury gains translated rise in total income, reported CNBC-TV18. \nBrokerage firm has maintained ‘equal weight’ rating on the stock with a target at Rs 2,215 per share. The asset quality, loan growth and margin continue to surprise, albeit were partially offset by higher than expected operating costs. \nThe deposit growth accelerating and expect positive jaws in FY24 and continue to expect strong earnings, reported CNBC-TV18. \nThe standalone net income came above estimates on better NIM and lower provisions, while revenue growth was driven by NIMs and loan growth. \nThe bank has reinvested gains to increase opex and asset quality continues to be solid with negative net slippages. The credit costs aided by a small drawdown in reserves, reported CNBC-TV18. \nBrokerage house has maintained the ‘buy’ rating on the stock with a target at Rs 2,470 per share as the Q3 profit ahead of estimates with stronger than expected NIM expansion and lower credit cost. \nThe strong loan growth aided by buoyancy in credit and ramp-up in unsecured loans. The CASA has lagged as bank lost share in bulkier savings deposits. \nDisclaimer: The views and investment tips expressed by experts on Moneycontrol.com are their own and not those of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions. \n"
  },
  {
    "title": "Buzzing Stocks: Reliance, Axis Bank, UltraTech Cement and others in news today",
    "date": "2023-01-24 18:26:52.918986",
    "sub para": "<p class=\"MT5\"><span class=\"mcp_btn_blue_tp\" title=\"Subscribe\">Subscribe</span></p>",
    "article para": "Find & Invest in bonds issued by top corporates, PSU Banks, NBFCs, and much more. Invest as low as 10,000 and earn better returns than FD \nFind safe & high-yielding bonds for your buck. Discover the right bonds meeting your investment amount & investment horizon \nCurated markets data, exclusive trading recommendations, Independent equity analysis & actionable investment ideas \nCurated markets data, exclusive trading recommendations, Independent equity analysis & actionable investment ideas \n"
  },
  {
    "title": "Atul share price falls 4% on dismal Q3 earnings",
    "date": "2023-01-24 18:26:53.856402",
    "sub para": "<p>The operating profit margin fell 460 basis point YoY to 13.6 percent for the quarter. One basis point is one-hundredth of a percentage point.</p>",
    "article para": "Find & Invest in bonds issued by top corporates, PSU Banks, NBFCs, and much more. Invest as low as 10,000 and earn better returns than FD \nFind safe & high-yielding bonds for your buck. Discover the right bonds meeting your investment amount & investment horizon \nCurated markets data, exclusive trading recommendations, Independent equity analysis & actionable investment ideas \nCurated markets data, exclusive trading recommendations, Independent equity analysis & actionable investment ideas \nThe company reported consolidated profit after tax at Rs 105.1 crore for the quarter ended December FY23, falling 32 percent from the year-ago period, impacted by lower topline and weak operating performance, Atul said in a BSE filing in the afternoon. The profit after tax for the December FY22 quarter was at Rs 155 crore. \nConsolidated revenue from operations at Rs 1,268.2 crore was down 8.1 percent on lower business in performance and other chemicals segment. \nThe performance and other chemicals segment, which contributed 65 percent to topline, registered a 19.3 percent year-on-year decline in revenue, but the life science chemicals segment reported nearly 24 percent growth YoY at Rs 492 crore, the company said. \nThe operating performance also disappointed, as EBITDA (earnings before interest, tax, depreciation and amortisation) dropped 31.5 percent to Rs 172.2 crore from the year-ago period. \nThe operating profit margin fell 460 basis point YoY to 13.6 percent for the quarter. One basis point is one-hundredth of a percentage point. \n"
  },
  {
    "title": "GPT Infraprojects up 8% on Rs 270-crore order win",
    "date": "2023-01-24 18:26:54.617573",
    "sub para": "<p>GPT Infraprojects is likely to be closely tracked in the run-up to the Budget 2023 as market participants believe that the railway-focussed companies can benefit from the expected announcements related to the sector.</p>",
    "article para": "Find & Invest in bonds issued by top corporates, PSU Banks, NBFCs, and much more. Invest as low as 10,000 and earn better returns than FD \nFind safe & high-yielding bonds for your buck. Discover the right bonds meeting your investment amount & investment horizon \nCurated markets data, exclusive trading recommendations, Independent equity analysis & actionable investment ideas \nCurated markets data, exclusive trading recommendations, Independent equity analysis & actionable investment ideas \nThe company has been asked by Bridge & Roof Company Ltd to build a rail flyover between Allahabad and Bamrauli in Uttar Pradesh. \nEarlier this week, the company got a Rs 216-crore order from Maharashtra Rail Infrastructure Development Corporation Ltd for the construction of extensions of the Ghatkopar Cable Stayed Road overbridge connecting LBS Road junction and Eastern Expressway Junction in Mumbai. \nThe company made inroads into the infrastructure segment in 2004 and is now an established railways-focused player. The company is engaged in the execution of civil and infrastructure projects, especially large bridges and ROBs for railways. \nThe company also manufactures and supplies concrete sleepers to railways in India and Africa. Its concrete sleeper business is spread out in countries such as South Africa, Namibia, Bangladesh and Sri Lanka. \nThe company has orders worth approximately Rs 2,471 crore, including cumulative order inflow of Rs 1,125 crore in the current financial year. \nAt 2.57 pm, the share was trading 4.9 percent higher at Rs 57.45 on the BSE. The company’s stock has risen 191 percent in the past three years. \nGPT Infraprojects is likely to be closely tracked in the run-up to the Budget 2023 as market participants believe that the railway-focussed companies can benefit from the expected announcements related to the sector. \n"
  }
]
